{"class_name": "Model", "config": {"name": "model_164", "layers": [{"name": "input_166", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 56], "dtype": "float32", "sparse": false, "name": "input_166"}, "inbound_nodes": []}, {"name": "conv2d_191", "class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": true, "filters": 336, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_166", 0, 0, {}]]]}, {"name": "batch_normalization_215", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_215", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_191", 0, 0, {}]]]}, {"name": "activation_173", "class_name": "Activation", "config": {"name": "activation_173", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_215", 0, 0, {}]]]}, {"name": "zero_padding2d_24", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_24", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_173", 0, 0, {}]]]}, {"name": "depthwise_conv2d_28", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_28", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["zero_padding2d_24", 0, 0, {}]]]}, {"name": "batch_normalization_216", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_216", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_28", 0, 0, {}]]]}, {"name": "activation_174", "class_name": "Activation", "config": {"name": "activation_174", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_216", 0, 0, {}]]]}, {"name": "conv2d_192", "class_name": "Conv2D", "config": {"name": "conv2d_192", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_174", 0, 0, {}]]]}, {"name": "batch_normalization_217", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_217", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_192", 0, 0, {}]]]}], "input_layers": [["input_166", 0, 0]], "output_layers": [["batch_normalization_217", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}