{"class_name": "Model", "config": {"name": "model_137", "layers": [{"name": "input_138", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 40], "dtype": "float32", "sparse": false, "name": "input_138"}, "inbound_nodes": []}, {"name": "conv2d_137", "class_name": "Conv2D", "config": {"name": "conv2d_137", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_138", 0, 0, {}]]]}, {"name": "batch_normalization_137", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_137", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_137", 0, 0, {}]]]}, {"name": "activation_119", "class_name": "Activation", "config": {"name": "activation_119", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_137", 0, 0, {}]]]}], "input_layers": [["input_138", 0, 0]], "output_layers": [["activation_119", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}