{"class_name": "Model", "config": {"name": "model_153", "layers": [{"name": "input_155", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 40], "dtype": "float32", "sparse": false, "name": "input_155"}, "inbound_nodes": []}, {"name": "conv2d_147", "class_name": "Conv2D", "config": {"name": "conv2d_147", "trainable": true, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_155", 0, 0, {}]]]}, {"name": "batch_normalization_153", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_153", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_147", 0, 0, {}]]]}, {"name": "activation_129", "class_name": "Activation", "config": {"name": "activation_129", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_153", 0, 0, {}]]]}, {"name": "depthwise_conv2d_10", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_10", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["activation_129", 0, 0, {}]]]}, {"name": "batch_normalization_154", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_154", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_10", 0, 0, {}]]]}, {"name": "activation_130", "class_name": "Activation", "config": {"name": "activation_130", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_154", 0, 0, {}]]]}, {"name": "conv2d_148", "class_name": "Conv2D", "config": {"name": "conv2d_148", "trainable": true, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_130", 0, 0, {}]]]}, {"name": "batch_normalization_155", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_155", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_148", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["input_155", 0, 0, {}], ["batch_normalization_155", 0, 0, {}]]]}], "input_layers": [["input_155", 0, 0]], "output_layers": [["add_2", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}