{"class_name": "Model", "config": {"name": "model_138", "layers": [{"name": "input_139", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 240], "dtype": "float32", "sparse": false, "name": "input_139"}, "inbound_nodes": []}, {"name": "depthwise_conv2d_1", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["input_139", 0, 0, {}]]]}, {"name": "batch_normalization_138", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_138", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]]}, {"name": "activation_120", "class_name": "Activation", "config": {"name": "activation_120", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_138", 0, 0, {}]]]}], "input_layers": [["input_139", 0, 0]], "output_layers": [["activation_120", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}