{"class_name": "Model", "config": {"name": "model_161", "layers": [{"name": "input_163", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_163"}, "inbound_nodes": []}, {"name": "zero_padding2d_21", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_21", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["input_163", 0, 0, {}]]]}, {"name": "conv2d_186", "class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_208", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_208", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"name": "activation_168", "class_name": "Activation", "config": {"name": "activation_168", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_208", 0, 0, {}]]]}], "input_layers": [["input_163", 0, 0]], "output_layers": [["activation_168", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}